# Pandas: Data Wrangling

## Introduction

Pandas is an essential library for data wrangling, transformation, and exploration in Python. This notebook expands on key functionality using realistic African-centric data examples.

In [1]:
import pandas as pd

In [2]:
Household=pd.read_csv("African_Household_Data.csv")
Household

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District
0,Rwanda,20,1235,166,6741,1440,42,2,Secondary,72.886134,Central
1,Ghana,68,4637,98,14281,981,39,3,Secondary,178.878356,East
2,Rwanda,48,301,238,7838,890,43,2,Tertiary,120.131577,East
3,Rwanda,57,3148,262,3587,1060,39,1,Secondary,110.633007,North
4,Ghana,54,4344,124,8876,631,31,2,Secondary,117.422414,Central
...,...,...,...,...,...,...,...,...,...,...,...
995,Nigeria,39,489,175,10021,220,35,2,Primary,98.783179,West
996,Nigeria,45,1280,132,2909,344,34,2,Tertiary,188.507700,Central
997,Rwanda,37,1998,172,7364,238,42,2,Secondary,112.602188,East
998,Rwanda,50,2015,235,3581,475,25,0,Tertiary,194.429350,Central
999,Ghana,27,2893,207,1691,1026,52,2,Secondary,53.625553,South

In [3]:
Household.head()

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District
0,Rwanda,20,1235,166,6741,1440,42,2,Secondary,72.886134,Central
1,Ghana,68,4637,98,14281,981,39,3,Secondary,178.878356,East
2,Rwanda,48,301,238,7838,890,43,2,Tertiary,120.131577,East
3,Rwanda,57,3148,262,3587,1060,39,1,Secondary,110.633007,North
4,Ghana,54,4344,124,8876,631,31,2,Secondary,117.422414,Central

In [4]:
Household.tail()

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District
995,Nigeria,39,489,175,10021,220,35,2,Primary,98.783179,West
996,Nigeria,45,1280,132,2909,344,34,2,Tertiary,188.507700,Central
997,Rwanda,37,1998,172,7364,238,42,2,Secondary,112.602188,East
998,Rwanda,50,2015,235,3581,475,25,0,Tertiary,194.429350,Central
999,Ghana,27,2893,207,1691,1026,52,2,Secondary,53.625553,South

## PART ONE

### 1. Creating a DataFrame

In [5]:
data = {
    'Country': ['Nigeria', 'Kenya', 'Ghana', 'South Africa', 'Egypt'],
    'Population': [213400000, 53770000, 31070000, 60410000, 104000000],
    'Area': [923768, 580367, 238535, 1219090, 1002450],
    'Capital': ['Abuja', 'Nairobi', 'Accra', 'Pretoria', 'Cairo']
}
df = pd.DataFrame(data)
df

        Country  Population     Area   Capital
0       Nigeria   213400000   923768     Abuja
1         Kenya    53770000   580367   Nairobi
2         Ghana    31070000   238535     Accra
3  South Africa    60410000  1219090  Pretoria
4         Egypt   104000000  1002450     Cairo

### 2. Using `.loc[]` for Label-based Indexing

In [6]:

df.loc[1]  # Second row by label

Country          Kenya
Population    53770000
Area            580367
Capital        Nairobi
Name: 1, dtype: object

### 3. Using `.iloc[]` for Position-based Indexing

In [7]:
df.iloc[2]  # Third row by index position

Country          Ghana
Population    31070000
Area            238535
Capital          Accra
Name: 2, dtype: object

### 4. Filtering with Conditions and `.loc[]`

In [8]:
df.loc[df['Population'] > 60000000, ['Country', 'Population']]

        Country  Population
0       Nigeria   213400000
3  South Africa    60410000
4         Egypt   104000000

### 5. Renaming Columns

In [9]:
df.rename(columns={'Population': 'Population_Total', 'Area': 'Land_Area_km2'}, inplace=True)
df

        Country  Population_Total  Land_Area_km2   Capital
0       Nigeria         213400000         923768     Abuja
1         Kenya          53770000         580367   Nairobi
2         Ghana          31070000         238535     Accra
3  South Africa          60410000        1219090  Pretoria
4         Egypt         104000000        1002450     Cairo

### 6. Adding New Columns

In [10]:
df['Density'] = df['Population_Total'] / df['Land_Area_km2']
df

        Country  Population_Total  Land_Area_km2   Capital     Density
0       Nigeria         213400000         923768     Abuja  231.010384
1         Kenya          53770000         580367   Nairobi   92.648273
2         Ghana          31070000         238535     Accra  130.253422
3  South Africa          60410000        1219090  Pretoria   49.553355
4         Egypt         104000000        1002450     Cairo  103.745823

### 7. Replacing Values

In [11]:
df['Capital'] = df['Capital'].replace({'Pretoria': 'Cape Town'})
df

        Country  Population_Total  Land_Area_km2    Capital     Density
0       Nigeria         213400000         923768      Abuja  231.010384
1         Kenya          53770000         580367    Nairobi   92.648273
2         Ghana          31070000         238535      Accra  130.253422
3  South Africa          60410000        1219090  Cape Town   49.553355
4         Egypt         104000000        1002450      Cairo  103.745823

### 8. Setting and Resetting Index

In [12]:
df.set_index('Country', inplace=True)
df.head()

              Population_Total  Land_Area_km2    Capital     Density
Country
Nigeria              213400000         923768      Abuja  231.010384
Kenya                 53770000         580367    Nairobi   92.648273
Ghana                 31070000         238535      Accra  130.253422
South Africa          60410000        1219090  Cape Town   49.553355
Egypt                104000000        1002450      Cairo  103.745823

In [13]:
df.reset_index(inplace=True)  # Restore default integer index
df.head()

        Country  Population_Total  Land_Area_km2    Capital     Density
0       Nigeria         213400000         923768      Abuja  231.010384
1         Kenya          53770000         580367    Nairobi   92.648273
2         Ghana          31070000         238535      Accra  130.253422
3  South Africa          60410000        1219090  Cape Town   49.553355
4         Egypt         104000000        1002450      Cairo  103.745823

### 9. Sorting by a Column

In [14]:
df.sort_values(by='Density', ascending=False)

        Country  Population_Total  Land_Area_km2    Capital     Density
0       Nigeria         213400000         923768      Abuja  231.010384
2         Ghana          31070000         238535      Accra  130.253422
4         Egypt         104000000        1002450      Cairo  103.745823
1         Kenya          53770000         580367    Nairobi   92.648273
3  South Africa          60410000        1219090  Cape Town   49.553355

### 10. Using `.apply()` with Custom Functions

In [15]:
def size_category(area):
    if area > 900000:
        return 'Large'
    elif area > 500000:
        return 'Medium'
    else:
        return 'Small'

df['Area_Category'] = df['Land_Area_km2'].apply(size_category)
df

,Country,Population_Total,Land_Area_km2,Capital,Density,Area_Category
0,Nigeria,213400000,923768,Abuja,231.010384,Large
1,Kenya,53770000,580367,Nairobi,92.648273,Medium
2,Ghana,31070000,238535,Accra,130.253422,Small
3,South Africa,60410000,1219090,Cape Town,49.553355,Large
4,Egypt,104000000,1002450,Cairo,103.745823,Large

### 11. Export to CSV

In [16]:
df.to_csv('african_country_data.csv', index=False)

# PART TWO

In [17]:
df = pd.read_csv('African_Household_Data.csv')

In [18]:
df.head()

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District
0,Rwanda,20,1235,166,6741,1440,42,2,Secondary,72.886134,Central
1,Ghana,68,4637,98,14281,981,39,3,Secondary,178.878356,East
2,Rwanda,48,301,238,7838,890,43,2,Tertiary,120.131577,East
3,Rwanda,57,3148,262,3587,1060,39,1,Secondary,110.633007,North
4,Ghana,54,4344,124,8876,631,31,2,Secondary,117.422414,Central

## Data Inspection and Basic Operations

### 1. Display first 5 rows

In [19]:
df.head()

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District
0,Rwanda,20,1235,166,6741,1440,42,2,Secondary,72.886134,Central
1,Ghana,68,4637,98,14281,981,39,3,Secondary,178.878356,East
2,Rwanda,48,301,238,7838,890,43,2,Tertiary,120.131577,East
3,Rwanda,57,3148,262,3587,1060,39,1,Secondary,110.633007,North
4,Ghana,54,4344,124,8876,631,31,2,Secondary,117.422414,Central

### 2. Display last 5 rows

In [20]:
df.tail()

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District
995,Nigeria,39,489,175,10021,220,35,2,Primary,98.783179,West
996,Nigeria,45,1280,132,2909,344,34,2,Tertiary,188.507700,Central
997,Rwanda,37,1998,172,7364,238,42,2,Secondary,112.602188,East
998,Rwanda,50,2015,235,3581,475,25,0,Tertiary,194.429350,Central
999,Ghana,27,2893,207,1691,1026,52,2,Secondary,53.625553,South

### 3. Show basic info about the DataFrame

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Country                 1000 non-null   object
 1   Age                     1000 non-null   int64
 2   MonthlyIncome           1000 non-null   int64
 3   ElectricityConsumption  1000 non-null   int64
 4   CocoaSales              1000 non-null   int64
 5   TransportCosts          1000 non-null   int64
 6   InternetUsageHours      1000 non-null   int64
 7   HospitalVisits          1000 non-null   int64
 8   EducationLevel          1000 non-null   object
 9   RainfallMM              1000 non-null   float64
 10  District                1000 non-null   object
dtypes: float64(1), int64(7), object(3)
memory usage: 86.1+ KB

### 4. Show summary statistics

In [22]:
df.describe()

,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,RainfallMM
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,43.645000,2604.006000,198.961000,7973.312000,775.685000,38.858000,1.900000,126.171131
std,14.810886,1346.366415,49.703621,4097.837958,422.173239,9.738412,1.292931,42.789161
min,18.000000,301.000000,26.000000,1016.000000,50.000000,8.000000,0.000000,50.027779
25%,31.000000,1416.750000,165.000000,4306.750000,392.750000,32.000000,1.000000,91.837039
50%,44.000000,2620.000000,200.000000,7878.000000,758.000000,39.000000,2.000000,125.740065
75%,56.000000,3786.000000,235.000000,11541.750000,1161.000000,45.000000,3.000000,162.181174
max,69.000000,4997.000000,336.000000,14998.000000,1499.000000,71.000000,8.000000,199.904740

### 5. List column names

In [23]:
df.columns

Index(['Country', 'Age', 'MonthlyIncome', 'ElectricityConsumption',
       'CocoaSales', 'TransportCosts', 'InternetUsageHours', 'HospitalVisits',
       'EducationLevel', 'RainfallMM', 'District'],
      dtype='object')

### 6. Check shape (rows, columns)

In [24]:
df.shape

(1000, 11)

### 7. Check for missing values

In [25]:
df.isnull().sum()

Country                   0
Age                       0
MonthlyIncome             0
ElectricityConsumption    0
CocoaSales                0
TransportCosts            0
InternetUsageHours        0
HospitalVisits            0
EducationLevel            0
RainfallMM                0
District                  0
dtype: int64

### 8. View data types of each column

In [26]:
df.dtypes

Country                    object
Age                         int64
MonthlyIncome               int64
ElectricityConsumption      int64
CocoaSales                  int64
TransportCosts              int64
InternetUsageHours          int64
HospitalVisits              int64
EducationLevel             object
RainfallMM                float64
District                   object
dtype: object

### 9. Get unique countries

In [27]:
df['EducationLevel'].head()

0    Secondary
1    Secondary
2     Tertiary
3    Secondary
4    Secondary
Name: EducationLevel, dtype: object

In [28]:
df[["RainfallMM","InternetUsageHours","District"]].head()

   RainfallMM  InternetUsageHours District
0   72.886134                  42  Central
1  178.878356                  39     East
2  120.131577                  43     East
3  110.633007                  39    North
4  117.422414                  31  Central

In [29]:
df['Country'].unique()

array(['Rwanda', 'Ghana', 'Nigeria'], dtype=object)

In [30]:
df['Country'].nunique()

3

### 10. Get number of unique values in each column

In [31]:
df.nunique()

Country                      3
Age                         52
MonthlyIncome              896
ElectricityConsumption     218
CocoaSales                 964
TransportCosts             721
InternetUsageHours          56
HospitalVisits               8
EducationLevel               3
RainfallMM                1000
District                     5
dtype: int64

## Filtering and Conditional Selection

### 11. Filter rows where Country is Ghana

In [61]:
df[df["Country"]=='Ghana']

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District,IncomeUSD,HighPowerUse,NetIncome,AgeGroup
1,Ghana,68,4637,98,14281,981,39,3,Secondary,178.878356,East,602.81,False,3656,61-70
4,Ghana,54,4344,124,8876,631,31,2,Secondary,117.422414,Central,564.72,False,3713,46-60
5,Ghana,53,2249,262,4262,1189,48,5,Secondary,195.788683,Central,292.37,True,1060,46-60
12,Ghana,28,4538,259,6232,437,50,1,Secondary,91.813370,West,589.94,True,4101,18-30
15,Ghana,23,1186,226,8845,687,32,3,Primary,108.060097,East,154.18,False,499,18-30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
984,Ghana,28,2804,139,3965,851,40,1,Secondary,145.942569,South,364.52,False,1953,18-30
985,Ghana,39,3072,234,5319,923,44,3,Tertiary,124.333354,West,399.36,False,2149,31-45
986,Ghana,68,1454,266,9975,521,56,2,Primary,52.681030,North,189.02,True,933,61-70
988,Ghana,58,4871,253,10141,674,41,0,Tertiary,77.580986,North,633.23,True,4197,46-60
999,Ghana,27,2893,207,1691,1026,52,2,Secondary,53.625553,South,376.09,False,1867,18-30

In [33]:
df[df['Country'] == 'Ghana']

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District
1,Ghana,68,4637,98,14281,981,39,3,Secondary,178.878356,East
4,Ghana,54,4344,124,8876,631,31,2,Secondary,117.422414,Central
5,Ghana,53,2249,262,4262,1189,48,5,Secondary,195.788683,Central
12,Ghana,28,4538,259,6232,437,50,1,Secondary,91.813370,West
15,Ghana,23,1186,226,8845,687,32,3,Primary,108.060097,East
...,...,...,...,...,...,...,...,...,...,...,...
984,Ghana,28,2804,139,3965,851,40,1,Secondary,145.942569,South
985,Ghana,39,3072,234,5319,923,44,3,Tertiary,124.333354,West
986,Ghana,68,1454,266,9975,521,56,2,Primary,52.681030,North
988,Ghana,58,4871,253,10141,674,41,0,Tertiary,77.580986,North
999,Ghana,27,2893,207,1691,1026,52,2,Secondary,53.625553,South

### 12. People older than 50

In [62]:
older_50 = df[df['Age'] > 50]

In [63]:
older_50

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District,IncomeUSD,HighPowerUse,NetIncome,AgeGroup
1,Ghana,68,4637,98,14281,981,39,3,Secondary,178.878356,East,602.81,False,3656,61-70
3,Rwanda,57,3148,262,3587,1060,39,1,Secondary,110.633007,North,409.24,True,2088,46-60
4,Ghana,54,4344,124,8876,631,31,2,Secondary,117.422414,Central,564.72,False,3713,46-60
5,Ghana,53,2249,262,4262,1189,48,5,Secondary,195.788683,Central,292.37,True,1060,46-60
16,Nigeria,66,727,174,10229,327,22,1,Tertiary,134.396150,West,94.51,False,400,61-70
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
981,Ghana,55,945,170,5926,1178,47,0,Secondary,122.281008,North,122.85,False,-233,46-60
982,Nigeria,58,3290,109,10379,277,45,1,Primary,134.464142,West,427.70,False,3013,46-60
986,Ghana,68,1454,266,9975,521,56,2,Primary,52.681030,North,189.02,True,933,61-70
988,Ghana,58,4871,253,10141,674,41,0,Tertiary,77.580986,North,633.23,True,4197,46-60
991,Rwanda,63,4379,216,2810,743,40,5,Secondary,134.570509,North,569.27,False,3636,61-70

In [35]:
df[(df['MonthlyIncome'] > 4000)&(df["Country"]=="Nigeria")].head()

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District
63,Nigeria,54,4944,210,8389,608,42,1,Secondary,152.856084,South
73,Nigeria,48,4188,232,10136,1244,34,6,Primary,61.199247,North
79,Nigeria,28,4911,182,12115,539,43,2,Tertiary,88.466603,East
111,Nigeria,57,4305,171,3259,1395,49,2,Tertiary,168.951546,North
119,Nigeria,50,4899,213,11846,837,42,3,Primary,136.291939,East

In [36]:
df['MonthlyIncome'] > 4000

0      False
1       True
2      False
3      False
4       True
       ...
995    False
996    False
997    False
998    False
999    False
Name: MonthlyIncome, Length: 1000, dtype: bool

In [37]:
df["Country"]=="Nigeria"

0      False
1      False
2      False
3      False
4      False
       ...
995     True
996     True
997    False
998    False
999    False
Name: Country, Length: 1000, dtype: bool

### 13. Households with monthly income over 3000 in Nigeria

In [38]:
df[(df['MonthlyIncome'] > 3000) & (df['Country'] == 'Nigeria')]

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District
7,Nigeria,48,3474,261,5996,1408,40,4,Primary,155.955316,West
22,Nigeria,28,3444,251,7837,184,38,3,Secondary,176.521875,South
46,Nigeria,30,3895,244,8086,976,31,1,Primary,188.268385,South
60,Nigeria,19,3965,221,2319,1421,36,0,Tertiary,108.904867,South
63,Nigeria,54,4944,210,8389,608,42,1,Secondary,152.856084,South
...,...,...,...,...,...,...,...,...,...,...,...
969,Nigeria,35,4011,185,6555,146,35,2,Secondary,178.421923,West
973,Nigeria,64,4164,206,4092,1333,39,2,Secondary,184.157461,South
977,Nigeria,28,3847,215,8478,108,49,3,Primary,74.156932,Central
982,Nigeria,58,3290,109,10379,277,45,1,Primary,134.464142,West
992,Nigeria,49,3648,281,5566,1022,51,5,Tertiary,81.594758,East

### 14. Users with InternetUsageHours less than 20

In [66]:
df[df['InternetUsageHours']<= 20].head()

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District,IncomeUSD,HighPowerUse,NetIncome,AgeGroup
20,Ghana,19,2225,103,4226,698,19,1,Tertiary,199.178862,North,289.25,False,1527,18-30
49,Nigeria,50,1566,180,5749,178,20,1,Primary,187.618433,East,203.58,False,1388,46-60
128,Rwanda,68,327,241,7953,1151,18,1,Secondary,126.509034,South,42.51,False,-824,61-70
135,Rwanda,68,4696,169,3411,1413,20,0,Tertiary,174.773618,South,610.48,False,3283,61-70
185,Ghana,43,425,178,3011,904,16,2,Secondary,123.214552,Central,55.25,False,-479,31-45

### 15. People from Central or East districts

In [71]:
df[df['District'].isin(['Central', 'East', 'North','Kigali'])]

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District,IncomeUSD,HighPowerUse,NetIncome,AgeGroup
0,Rwanda,20,1235,166,6741,1440,42,2,Secondary,72.886134,Central,160.55,False,-205,18-30
1,Ghana,68,4637,98,14281,981,39,3,Secondary,178.878356,East,602.81,False,3656,61-70
2,Rwanda,48,301,238,7838,890,43,2,Tertiary,120.131577,East,39.13,False,-589,46-60
3,Rwanda,57,3148,262,3587,1060,39,1,Secondary,110.633007,North,409.24,True,2088,46-60
4,Ghana,54,4344,124,8876,631,31,2,Secondary,117.422414,Central,564.72,False,3713,46-60
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
992,Nigeria,49,3648,281,5566,1022,51,5,Tertiary,81.594758,East,474.24,True,2626,46-60
993,Rwanda,32,4131,287,11273,162,37,3,Primary,192.326876,East,537.03,True,3969,31-45
996,Nigeria,45,1280,132,2909,344,34,2,Tertiary,188.507700,Central,166.40,False,936,31-45
997,Rwanda,37,1998,172,7364,238,42,2,Secondary,112.602188,East,259.74,False,1760,31-45
998,Rwanda,50,2015,235,3581,475,25,0,Tertiary,194.429350,Central,261.95,False,1540,46-60

### 16. People with tertiary education in Rwanda

In [72]:
df[(df['EducationLevel'] == 'Tertiary') & (df['Country'] == 'Rwanda')]

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District,IncomeUSD,HighPowerUse,NetIncome,AgeGroup
2,Rwanda,48,301,238,7838,890,43,2,Tertiary,120.131577,East,39.13,False,-589,46-60
9,Rwanda,19,389,206,6780,197,53,2,Tertiary,74.775950,North,50.57,False,192,18-30
11,Rwanda,45,2469,160,14873,1361,34,2,Tertiary,113.461328,West,320.97,False,1108,31-45
28,Rwanda,22,2013,213,4414,433,43,3,Tertiary,187.738725,North,261.69,False,1580,18-30
41,Rwanda,31,709,221,2678,193,29,1,Tertiary,129.793355,South,92.17,False,516,31-45
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
938,Rwanda,67,3639,257,14374,897,45,3,Tertiary,143.469938,North,473.07,True,2742,61-70
945,Rwanda,20,3276,197,6956,1463,45,3,Tertiary,147.426574,South,425.88,False,1813,18-30
950,Rwanda,47,3990,149,13917,497,49,2,Tertiary,135.497423,South,518.70,False,3493,46-60
967,Rwanda,25,1894,258,13515,1010,8,2,Tertiary,117.388984,South,246.22,True,884,18-30
998,Rwanda,50,2015,235,3581,475,25,0,Tertiary,194.429350,Central,261.95,False,1540,46-60

### 17. People between 25 and 35 years old

In [73]:
df[(df['Age'] >= 25) & (df['Age'] <= 35)]

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District,IncomeUSD,HighPowerUse,NetIncome,AgeGroup
12,Ghana,28,4538,259,6232,437,50,1,Secondary,91.813370,West,589.94,True,4101,18-30
14,Nigeria,32,405,179,4539,965,32,2,Tertiary,187.677113,North,52.65,False,-560,31-45
21,Ghana,32,2356,206,14878,667,39,1,Primary,193.485629,West,306.28,False,1689,31-45
22,Nigeria,28,3444,251,7837,184,38,3,Secondary,176.521875,South,447.72,True,3260,18-30
23,Nigeria,25,2570,134,8031,629,36,3,Primary,153.256082,Central,334.10,False,1941,18-30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
989,Nigeria,34,2121,301,4939,62,29,1,Primary,152.021426,Central,275.73,True,2059,31-45
990,Nigeria,29,1285,248,1044,1091,31,1,Secondary,58.505698,East,167.05,False,194,18-30
993,Rwanda,32,4131,287,11273,162,37,3,Primary,192.326876,East,537.03,True,3969,31-45
994,Nigeria,33,1541,288,12690,278,37,3,Primary,100.331141,South,200.33,True,1263,31-45
999,Ghana,27,2893,207,1691,1026,52,2,Secondary,53.625553,South,376.09,False,1867,18-30

### 18. Individuals with exactly 0 hospital visits

In [74]:
df[df['HospitalVisits'] == 0]

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District,IncomeUSD,HighPowerUse,NetIncome,AgeGroup
10,Rwanda,37,2009,218,3827,1082,46,0,Primary,188.215044,West,261.17,False,927,31-45
25,Ghana,68,852,233,11516,539,28,0,Primary,187.011941,South,110.76,False,313,61-70
29,Rwanda,23,3689,232,2448,212,31,0,Secondary,140.450576,North,479.57,False,3477,18-30
30,Nigeria,43,1407,151,1570,490,41,0,Primary,170.458433,East,182.91,False,917,31-45
31,Rwanda,21,4506,207,3904,1262,53,0,Primary,168.754265,North,585.78,False,3244,18-30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
961,Nigeria,19,969,196,4195,206,41,0,Tertiary,87.731833,Central,125.97,False,763,18-30
963,Ghana,25,1583,224,12556,300,45,0,Primary,118.977662,South,205.79,False,1283,18-30
981,Ghana,55,945,170,5926,1178,47,0,Secondary,122.281008,North,122.85,False,-233,46-60
988,Ghana,58,4871,253,10141,674,41,0,Tertiary,77.580986,North,633.23,True,4197,46-60
998,Rwanda,50,2015,235,3581,475,25,0,Tertiary,194.429350,Central,261.95,False,1540,46-60

### 19. People who use internet more than 60 hours and live in Ghana

In [75]:
df[(df['InternetUsageHours'] > 60) & (df['Country'] == 'Ghana')]

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District,IncomeUSD,HighPowerUse,NetIncome,AgeGroup
224,Ghana,68,4333,136,10486,755,71,2,Secondary,140.544815,North,563.29,False,3578,61-70
489,Ghana,52,4487,216,5005,224,61,2,Tertiary,95.388823,Central,583.31,False,4263,46-60
958,Ghana,55,874,152,2094,881,63,1,Secondary,131.590462,West,113.62,False,-7,46-60

 ### 20. People with monthly income below the mean

In [78]:
# How to find the mean for the dataframe
df['MonthlyIncome'].mean()

2604.006

In [45]:
df[df['MonthlyIncome'] < df['MonthlyIncome'].mean()]

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District
0,Rwanda,20,1235,166,6741,1440,42,2,Secondary,72.886134,Central
2,Rwanda,48,301,238,7838,890,43,2,Tertiary,120.131577,East
5,Ghana,53,2249,262,4262,1189,48,5,Secondary,195.788683,Central
6,Rwanda,41,1217,194,2338,288,42,3,Primary,177.540109,East
8,Rwanda,23,2541,201,12826,490,30,2,Secondary,93.571844,West
...,...,...,...,...,...,...,...,...,...,...,...
994,Nigeria,33,1541,288,12690,278,37,3,Primary,100.331141,South
995,Nigeria,39,489,175,10021,220,35,2,Primary,98.783179,West
996,Nigeria,45,1280,132,2909,344,34,2,Tertiary,188.507700,Central
997,Rwanda,37,1998,172,7364,238,42,2,Secondary,112.602188,East
998,Rwanda,50,2015,235,3581,475,25,0,Tertiary,194.429350,Central

## Aggregation and Grouping

### 21. Average income by country

In [89]:
df.groupby('Country')['MonthlyIncome'].median()

Country
Ghana      2589.0
Nigeria    2421.5
Rwanda     2768.0
Name: MonthlyIncome, dtype: float64

### 22. Total cocoa sales by country

In [47]:
df.groupby('Country')['CocoaSales'].sum()

Country
Ghana      2828033
Nigeria    2558449
Rwanda     2586830
Name: CocoaSales, dtype: int64

### 23. Max transport cost by district

In [48]:
df.groupby('District')['TransportCosts'].max()

District
Central    1499
East       1498
North      1499
South      1496
West       1495
Name: TransportCosts, dtype: int64

### 24. Mean internet usage by education level

In [49]:
df.groupby('EducationLevel')['InternetUsageHours'].mean()

EducationLevel
Primary      39.035503
Secondary    39.219020
Tertiary     38.269841
Name: InternetUsageHours, dtype: float64

### 25. Hospital visits by district

In [50]:
df.groupby('District')['HospitalVisits'].sum()

District
Central    346
East       406
North      353
South      421
West       374
Name: HospitalVisits, dtype: int64

## Column Operations and Transformation

### 26. Add a new column for income in USD (assuming 1 local = 0.13 USD)

In [91]:
df.columns

Index(['Country', 'Age', 'MonthlyIncome', 'ElectricityConsumption',
       'CocoaSales', 'TransportCosts', 'InternetUsageHours', 'HospitalVisits',
       'EducationLevel', 'RainfallMM', 'District', 'IncomeUSD', 'HighPowerUse',
       'NetIncome', 'AgeGroup'],
      dtype='object')

In [100]:
df["Experience"]= df['MonthlyIncome']/ df['InternetUsageHours']

In [101]:
df.columns

Index(['Country', 'Age', 'MonthlyIncome', 'ElectricityConsumption',
       'CocoaSales', 'TransportCosts', 'InternetUsageHours', 'HospitalVisits',
       'EducationLevel', 'RainfallMM', 'District', 'IncomeUSD', 'HighPowerUse',
       'NetIncome', 'AgeGroup', 'Experience'],
      dtype='object')

In [99]:
df.head()

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District,IncomeUSD,HighPowerUse,NetIncome,AgeGroup,Experience
0,Rwanda,20,1235,166,6741,1440,42,2,Secondary,72.886134,Central,160.55,False,-205,18-30,31.782387
1,Ghana,68,4637,98,14281,981,39,3,Secondary,178.878356,East,602.81,False,3656,61-70,119.331927
2,Rwanda,48,301,238,7838,890,43,2,Tertiary,120.131577,East,39.13,False,-589,46-60,7.746153
3,Rwanda,57,3148,262,3587,1060,39,1,Secondary,110.633007,North,409.24,True,2088,46-60,81.012919
4,Ghana,54,4344,124,8876,631,31,2,Secondary,117.422414,Central,564.72,False,3713,46-60,111.791652

In [51]:
df['IncomeUSD'] = df['MonthlyIncome'] * 0.13

In [102]:
df.columns

Index(['Country', 'Age', 'MonthlyIncome', 'ElectricityConsumption',
       'CocoaSales', 'TransportCosts', 'InternetUsageHours', 'HospitalVisits',
       'EducationLevel', 'RainfallMM', 'District', 'IncomeUSD', 'HighPowerUse',
       'NetIncome', 'AgeGroup', 'Experience'],
      dtype='object')

In [103]:
df['IncomeRWF'] = df['IncomeUSD']*1457

In [105]:
df.head()

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District,IncomeUSD,HighPowerUse,NetIncome,AgeGroup,Experience,IncomeRWF
0,Rwanda,20,1235,166,6741,1440,42,2,Secondary,72.886134,Central,160.55,False,-205,18-30,29.404762,233921.35
1,Ghana,68,4637,98,14281,981,39,3,Secondary,178.878356,East,602.81,False,3656,61-70,118.897436,878294.17
2,Rwanda,48,301,238,7838,890,43,2,Tertiary,120.131577,East,39.13,False,-589,46-60,7.000000,57012.41
3,Rwanda,57,3148,262,3587,1060,39,1,Secondary,110.633007,North,409.24,True,2088,46-60,80.717949,596262.68
4,Ghana,54,4344,124,8876,631,31,2,Secondary,117.422414,Central,564.72,False,3713,46-60,140.129032,822797.04

### 27. Flag high electricity consumers

In [52]:
df['HighPowerUse'] = df['ElectricityConsumption'] > 250

In [107]:
df.head()

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District,IncomeUSD,HighPowerUse,NetIncome,AgeGroup,Experience,IncomeRWF
0,Rwanda,20,1235,166,6741,1440,42,2,Secondary,72.886134,Central,160.55,False,-205,18-30,29.404762,233921.35
1,Ghana,68,4637,98,14281,981,39,3,Secondary,178.878356,East,602.81,False,3656,61-70,118.897436,878294.17
2,Rwanda,48,301,238,7838,890,43,2,Tertiary,120.131577,East,39.13,False,-589,46-60,7.000000,57012.41
3,Rwanda,57,3148,262,3587,1060,39,1,Secondary,110.633007,North,409.24,True,2088,46-60,80.717949,596262.68
4,Ghana,54,4344,124,8876,631,31,2,Secondary,117.422414,Central,564.72,False,3713,46-60,140.129032,822797.04

### 28. Total monthly expense (income - transport cost)

In [53]:
df['NetIncome'] = df['MonthlyIncome'] - df['TransportCosts']

### 29. Create an age group column

In [108]:
df['AgeGroup'] = pd.cut(df['Age'], bins=[18, 30, 45, 60, 70], labels=['18-30', '31-45', '46-60', '61-70'])

In [109]:
df.head()

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District,IncomeUSD,HighPowerUse,NetIncome,AgeGroup,Experience,IncomeRWF
0,Rwanda,20,1235,166,6741,1440,42,2,Secondary,72.886134,Central,160.55,False,-205,18-30,29.404762,233921.35
1,Ghana,68,4637,98,14281,981,39,3,Secondary,178.878356,East,602.81,False,3656,61-70,118.897436,878294.17
2,Rwanda,48,301,238,7838,890,43,2,Tertiary,120.131577,East,39.13,False,-589,46-60,7.000000,57012.41
3,Rwanda,57,3148,262,3587,1060,39,1,Secondary,110.633007,North,409.24,True,2088,46-60,80.717949,596262.68
4,Ghana,54,4344,124,8876,631,31,2,Secondary,117.422414,Central,564.72,False,3713,46-60,140.129032,822797.04

## Advanced Features

### 30. Top 10 highest income earners

In [111]:
df.nlargest(5, 'MonthlyIncome')

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District,IncomeUSD,HighPowerUse,NetIncome,AgeGroup,Experience,IncomeRWF
795,Ghana,48,4997,226,11589,319,30,2,Primary,146.751472,North,649.61,False,4678,46-60,166.566667,946481.77
876,Ghana,40,4988,195,13662,1441,33,4,Tertiary,140.978880,East,648.44,False,3547,31-45,151.151515,944777.08
214,Nigeria,65,4983,226,12029,657,43,1,Secondary,121.312436,East,647.79,False,4326,61-70,115.883721,943830.03
896,Ghana,31,4983,288,3941,1022,47,2,Secondary,164.983594,West,647.79,True,3961,31-45,106.021277,943830.03
342,Rwanda,24,4976,142,12737,1160,24,1,Secondary,189.215913,West,646.88,False,3816,18-30,207.333333,942504.16

### 31. Bottom 5 in internet usage

In [56]:
df.nsmallest(5, 'InternetUsageHours')

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District,IncomeUSD,HighPowerUse,NetIncome,AgeGroup
967,Rwanda,25,1894,258,13515,1010,8,2,Tertiary,117.388984,South,246.22,True,884,18-30
440,Nigeria,23,1901,180,10665,930,9,3,Primary,146.411907,Central,247.13,False,971,18-30
877,Nigeria,43,1987,251,7782,1326,10,2,Secondary,65.559525,East,258.31,True,661,31-45
275,Ghana,66,3322,187,2445,951,11,2,Tertiary,82.583615,Central,431.86,False,2371,61-70
449,Ghana,54,561,202,12410,552,11,4,Secondary,173.180031,Central,72.93,False,9,46-60

### 32. Sort by age descending

In [115]:
df.sort_values('ElectricityConsumption')

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District,IncomeUSD,HighPowerUse,NetIncome,AgeGroup,Experience,IncomeRWF
555,Nigeria,42,2857,26,3341,1139,43,1,Secondary,127.821247,North,371.41,False,1718,31-45,66.441860,541144.37
382,Ghana,65,2864,58,5512,1260,46,1,Primary,137.515345,West,372.32,False,1604,61-70,62.260870,542470.24
858,Nigeria,31,4037,65,4246,221,51,5,Secondary,76.867893,North,524.81,False,3816,31-45,79.156863,764648.17
415,Ghana,40,3259,68,9924,911,30,1,Secondary,51.809378,North,423.67,False,2348,31-45,108.633333,617287.19
577,Nigeria,68,1088,72,9721,936,33,2,Secondary,72.128575,Central,141.44,False,152,61-70,32.969697,206078.08
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
547,Nigeria,34,971,331,6552,655,24,4,Primary,88.648553,Central,126.23,True,316,31-45,40.458333,183917.11
158,Ghana,22,2503,333,10095,213,39,0,Secondary,56.706040,Central,325.39,True,2290,18-30,64.179487,474093.23
75,Nigeria,22,2277,334,4875,542,25,2,Tertiary,53.096516,East,296.01,True,1735,18-30,91.080000,431286.57
262,Rwanda,51,3189,335,14304,260,61,1,Primary,80.790791,South,414.57,True,2929,46-60,52.278689,604028.49
113,Rwanda,49,4948,336,2257,1497,41,2,Secondary,127.795804,Central,643.24,True,3451,46-60,120.682927,937200.68

In [57]:
df.sort_values('Age', ascending=False)

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District,IncomeUSD,HighPowerUse,NetIncome,AgeGroup
168,Ghana,69,1268,152,2036,710,49,3,Tertiary,88.515427,North,164.84,False,558,61-70
249,Rwanda,69,4026,243,11022,926,33,0,Secondary,100.395546,South,523.38,False,3100,61-70
501,Nigeria,69,3501,137,11988,376,31,2,Tertiary,119.373532,East,455.13,False,3125,61-70
864,Rwanda,69,3970,145,3017,624,31,0,Tertiary,152.396732,East,516.10,False,3346,61-70
368,Nigeria,69,3902,278,2647,506,31,3,Tertiary,108.466298,West,507.26,True,3396,61-70
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
326,Ghana,18,4276,117,11165,1166,53,1,Secondary,107.920460,Central,555.88,False,3110,NaN
85,Nigeria,18,1573,287,13583,1389,26,2,Primary,165.076899,North,204.49,True,184,NaN
62,Nigeria,18,961,245,5627,370,36,2,Secondary,127.262656,South,124.93,False,591,NaN
915,Ghana,18,4167,194,5586,970,29,0,Primary,68.984320,West,541.71,False,3197,NaN
648,Nigeria,18,2530,218,4904,678,38,2,Tertiary,184.178486,East,328.90,False,1852,NaN

### 33. Sort by Country and then Income

In [58]:
df.sort_values(['Country', 'MonthlyIncome'], ascending=[True, False])

,Country,Age,MonthlyIncome,ElectricityConsumption,CocoaSales,TransportCosts,InternetUsageHours,HospitalVisits,EducationLevel,RainfallMM,District,IncomeUSD,HighPowerUse,NetIncome,AgeGroup
795,Ghana,48,4997,226,11589,319,30,2,Primary,146.751472,North,649.61,False,4678,46-60
876,Ghana,40,4988,195,13662,1441,33,4,Tertiary,140.978880,East,648.44,False,3547,31-45
896,Ghana,31,4983,288,3941,1022,47,2,Secondary,164.983594,West,647.79,True,3961,31-45
810,Ghana,29,4976,208,7009,595,54,1,Secondary,146.412787,Central,646.88,False,4381,18-30
882,Ghana,21,4924,224,9307,1097,48,3,Tertiary,53.836847,West,640.12,False,3827,18-30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9,Rwanda,19,389,206,6780,197,53,2,Tertiary,74.775950,North,50.57,False,192,18-30
128,Rwanda,68,327,241,7953,1151,18,1,Secondary,126.509034,South,42.51,False,-824,61-70
118,Rwanda,32,313,155,2230,554,49,1,Primary,133.204876,South,40.69,False,-241,31-45
329,Rwanda,56,309,216,4968,671,40,1,Primary,62.410262,East,40.17,False,-362,46-60
2,Rwanda,48,301,238,7838,890,43,2,Tertiary,120.131577,East,39.13,False,-589,46-60

### 34. Pivot table: Average income by Country and EducationLevel

In [116]:
df.pivot_table(values='Age', index='Country', columns='EducationLevel', aggfunc='mean')

EducationLevel    Primary  Secondary   Tertiary
Country
Ghana           44.770370  42.298246  42.603774
Nigeria         40.371429  43.008929  45.110092
Rwanda          43.102041  45.099174  46.090000

### 35. Export filtered dataframe

In [60]:
df[df['Country'] == 'Rwanda'].to_csv("rwanda_data.csv", index=False)

In [121]:
df[df['EducationLevel'] == 'Secondary'].to_excel("secondary sudents.xlsx")

### How to access the dataset on Github

In [122]:
url ='https://raw.githubusercontent.com/ddaeducation/data/main/brasil-real-estate-1.csv'
brasil_data = pd.read_csv(url)

In [124]:
brasil_data.head()

,Unnamed: 0,property_type,place_with_parent_names,region,lat-lon,area_m2,price_usd
0,1,apartment,|Brasil|Alagoas|MaceiÃ³|,Northeast,"-9.6443051,-35.7088142",110,"$187,230.85"
1,2,apartment,|Brasil|Alagoas|MaceiÃ³|,Northeast,"-9.6430934,-35.70484",65,"$81,133.37"
2,3,house,|Brasil|Alagoas|MaceiÃ³|,Northeast,"-9.6227033,-35.7297953",211,"$154,465.45"
3,4,apartment,|Brasil|Alagoas|MaceiÃ³|,Northeast,"-9.622837,-35.719556",99,"$146,013.20"
4,5,apartment,|Brasil|Alagoas|MaceiÃ³|,Northeast,"-9.654955,-35.700227",55,"$101,416.71"

## Hands-on Exercises

1. Rename all columns to lowercase with underscores.
2. Filter rows where density is above 200.
3. Create a new column: `GDP` and calculate `GDP per capita`.
4. Sort countries by population in descending order.
5. Set 'Country' as index and extract data using `.loc[]` and `.iloc[]`.
6. Save final cleaned data to a new CSV file.

## Conclusion

With Pandas, you can clean, reshape, analyze, and transform datasets efficiently. Real-world datasets from African countries can be explored more deeply with functions like `.loc`, `.iloc`, `.apply()`, and `.groupby()`.